garyPenhook/PIC-Assembler/device_includes/pic16f13254.inc
// Register: CCPR2H
#define CCPR2H CCPR2H
CCPR2H                                   equ 0411h
// bitfield definitions
CCPR2H_CCPRH_POSN                        equ 0000h
CCPR2H_CCPRH_POSITION                    equ 0000h
CCPR2H_CCPRH_SIZE                        equ 0008h
CCPR2H_CCPRH_LENGTH                      equ 0008h
CCPR2H_CCPRH_MASK                        equ 00FFh

// Register: CCP2CON
#define CCP2CON CCP2CON
CCP2CON                                  equ 0412h
// bitfield definitions
CCP2CON_MODE_POSN                        equ 0000h
CCP2CON_MODE_POSITION                    equ 0000h
CCP2CON_MODE_SIZE                        equ 0004h
CCP2CON_MODE_LENGTH                      equ 0004h
CCP2CON_MODE_MASK                        equ 000Fh
CCP2CON_FMT_POSN                         equ 0004h
CCP2CON_FMT_POSITION                     equ 0004h
CCP2CON_FMT_SIZE                         equ 0001h
CCP2CON_FMT_LENGTH                       equ 0001h
CCP2CON_FMT_MASK                         equ 0010h
CCP2CON_OUT_POSN                         equ 0005h
CCP2CON_OUT_POSITION                     equ 0005h
CCP2CON_OUT_SIZE                         equ 0001h
CCP2CON_OUT_LENGTH                       equ 0001h
CCP2CON_OUT_MASK                         equ 0020h
CCP2CON_EN_POSN                          equ 0007h
CCP2CON_EN_POSITION                      equ 0007h
CCP2CON_EN_SIZE                          equ 0001h
CCP2CON_EN_LENGTH                        equ 0001h
CCP2CON_EN_MASK                          equ 0080h
CCP2CON_MODE0_POSN                       equ 0000h
CCP2CON_MODE0_POSITION                   equ 0000h
CCP2CON_MODE0_SIZE                       equ 0001h
CCP2CON_MODE0_LENGTH                     equ 0001h
CCP2CON_MODE0_MASK                       equ 0001h
CCP2CON_MODE1_POSN                       equ 0001h
CCP2CON_MODE1_POSITION                   equ 0001h
CCP2CON_MODE1_SIZE                       equ 0001h
CCP2CON_MODE1_LENGTH                     equ 0001h
CCP2CON_MODE1_MASK                       equ 0002h
CCP2CON_MODE2_POSN                       equ 0002h
CCP2CON_MODE2_POSITION                   equ 0002h
CCP2CON_MODE2_SIZE                       equ 0001h
CCP2CON_MODE2_LENGTH                     equ 0001h
CCP2CON_MODE2_MASK                       equ 0004h
CCP2CON_MODE3_POSN                       equ 0003h
CCP2CON_MODE3_POSITION                   equ 0003h
CCP2CON_MODE3_SIZE                       equ 0001h
CCP2CON_MODE3_LENGTH                     equ 0001h
CCP2CON_MODE3_MASK                       equ 0008h
CCP2CON_CCP2MODE_POSN                    equ 0000h
CCP2CON_CCP2MODE_POSITION                equ 0000h
CCP2CON_CCP2MODE_SIZE                    equ 0004h
CCP2CON_CCP2MODE_LENGTH                  equ 0004h
CCP2CON_CCP2MODE_MASK                    equ 000Fh
CCP2CON_CCP2FMT_POSN                     equ 0004h
CCP2CON_CCP2FMT_POSITION                 equ 0004h
CCP2CON_CCP2FMT_SIZE                     equ 0001h
CCP2CON_CCP2FMT_LENGTH                   equ 0001h
CCP2CON_CCP2FMT_MASK                     equ 0010h
CCP2CON_CCP2OUT_POSN                     equ 0005h
CCP2CON_CCP2OUT_POSITION                 equ 0005h
CCP2CON_CCP2OUT_SIZE                     equ 0001h
CCP2CON_CCP2OUT_LENGTH                   equ 0001h
CCP2CON_CCP2OUT_MASK                     equ 0020h
CCP2CON_CCP2EN_POSN                      equ 0007h
CCP2CON_CCP2EN_POSITION                  equ 0007h
CCP2CON_CCP2EN_SIZE                      equ 0001h
CCP2CON_CCP2EN_LENGTH                    equ 0001h
CCP2CON_CCP2EN_MASK                      equ 0080h
CCP2CON_CCP2MODE0_POSN                   equ 0000h
CCP2CON_CCP2MODE0_POSITION               equ 0000h
CCP2CON_CCP2MODE0_SIZE                   equ 0001h
CCP2CON_CCP2MODE0_LENGTH                 equ 0001h
CCP2CON_CCP2MODE0_MASK                   equ 0001h
CCP2CON_CCP2MODE1_POSN                   equ 0001h
CCP2CON_CCP2MODE1_POSITION               equ 0001h
CCP2CON_CCP2MODE1_SIZE                   equ 0001h
CCP2CON_CCP2MODE1_LENGTH                 equ 0001h
CCP2CON_CCP2MODE1_MASK                   equ 0002h
CCP2CON_CCP2MODE2_POSN                   equ 0002h
CCP2CON_CCP2MODE2_POSITION               equ 0002h
CCP2CON_CCP2MODE2_SIZE                   equ 0001h
CCP2CON_CCP2MODE2_LENGTH                 equ 0001h
CCP2CON_CCP2MODE2_MASK                   equ 0004h
CCP2CON_CCP2MODE3_POSN                   equ 0003h
CCP2CON_CCP2MODE3_POSITION               equ 0003h
CCP2CON_CCP2MODE3_SIZE                   equ 0001h
CCP2CON_CCP2MODE3_LENGTH                 equ 0001h
CCP2CON_CCP2MODE3_MASK                   equ 0008h
CCP2CON_P2M1_POSN                        equ 0007h
CCP2CON_P2M1_POSITION                    equ 0007h
CCP2CON_P2M1_SIZE                        equ 0001h
CCP2CON_P2M1_LENGTH                      equ 0001h
CCP2CON_P2M1_MASK                        equ 0080h

// Register: CCP2CAP
#define CCP2CAP CCP2CAP
CCP2CAP                                  equ 0413h
// bitfield definitions
CCP2CAP_CTS_POSN                         equ 0000h
CCP2CAP_CTS_POSITION                     equ 0000h
CCP2CAP_CTS_SIZE                         equ 0006h
CCP2CAP_CTS_LENGTH                       equ 0006h
CCP2CAP_CTS_MASK                         equ 003Fh
CCP2CAP_CTS0_POSN                        equ 0000h
CCP2CAP_CTS0_POSITION                    equ 0000h
CCP2CAP_CTS0_SIZE                        equ 0001h
CCP2CAP_CTS0_LENGTH                      equ 0001h
CCP2CAP_CTS0_MASK                        equ 0001h
CCP2CAP_CTS1_POSN                        equ 0001h
CCP2CAP_CTS1_POSITION                    equ 0001h
CCP2CAP_CTS1_SIZE                        equ 0001h
CCP2CAP_CTS1_LENGTH                      equ 0001h
CCP2CAP_CTS1_MASK                        equ 0002h
CCP2CAP_CTS2_POSN                        equ 0002h
CCP2CAP_CTS2_POSITION                    equ 0002h
CCP2CAP_CTS2_SIZE                        equ 0001h
CCP2CAP_CTS2_LENGTH                      equ 0001h
CCP2CAP_CTS2_MASK                        equ 0004h
CCP2CAP_CTS3_POSN                        equ 0003h
CCP2CAP_CTS3_POSITION                    equ 0003h
CCP2CAP_CTS3_SIZE                        equ 0001h
CCP2CAP_CTS3_LENGTH                      equ 0001h
CCP2CAP_CTS3_MASK                        equ 0008h
CCP2CAP_CCP2CTS_POSN                     equ 0000h
CCP2CAP_CCP2CTS_POSITION                 equ 0000h
CCP2CAP_CCP2CTS_SIZE                     equ 0006h
CCP2CAP_CCP2CTS_LENGTH                   equ 0006h
CCP2CAP_CCP2CTS_MASK                     equ 003Fh
CCP2CAP_CCP2CTS0_POSN                    equ 0000h
CCP2CAP_CCP2CTS0_POSITION                equ 0000h
CCP2CAP_CCP2CTS0_SIZE                    equ 0001h
CCP2CAP_CCP2CTS0_LENGTH                  equ 0001h
CCP2CAP_CCP2CTS0_MASK                    equ 0001h
CCP2CAP_CCP2CTS1_POSN                    equ 0001h
CCP2CAP_CCP2CTS1_POSITION                equ 0001h
CCP2CAP_CCP2CTS1_SIZE                    equ 0001h
CCP2CAP_CCP2CTS1_LENGTH                  equ 0001h
CCP2CAP_CCP2CTS1_MASK                    equ 0002h
CCP2CAP_CCP2CTS2_POSN                    equ 0002h
CCP2CAP_CCP2CTS2_POSITION                equ 0002h
CCP2CAP_CCP2CTS2_SIZE                    equ 0001h
CCP2CAP_CCP2CTS2_LENGTH                  equ 0001h
CCP2CAP_CCP2CTS2_MASK                    equ 0004h
CCP2CAP_CCP2CTS3_POSN                    equ 0003h
CCP2CAP_CCP2CTS3_POSITION                equ 0003h
CCP2CAP_CCP2CTS3_SIZE                    equ 0001h
CCP2CAP_CCP2CTS3_LENGTH                  equ 0001h
CCP2CAP_CCP2CTS3_MASK                    equ 0008h

// Register: CCPTMRS0
#define CCPTMRS0 CCPTMRS0
CCPTMRS0                                 equ 041Fh
// bitfield definitions
CCPTMRS0_C1TSEL_POSN                     equ 0000h
CCPTMRS0_C1TSEL_POSITION                 equ 0000h
CCPTMRS0_C1TSEL_SIZE                     equ 0002h
CCPTMRS0_C1TSEL_LENGTH                   equ 0002h
CCPTMRS0_C1TSEL_MASK                     equ 0003h
CCPTMRS0_C2TSEL_POSN                     equ 0002h
CCPTMRS0_C2TSEL_POSITION                 equ 0002h
CCPTMRS0_C2TSEL_SIZE                     equ 0002h
CCPTMRS0_C2TSEL_LENGTH                   equ 0002h
CCPTMRS0_C2TSEL_MASK                     equ 000Ch

// Register: PWM1ERS
#define PWM1ERS PWM1ERS
PWM1ERS                                  equ 048Ch
// bitfield definitions
PWM1ERS_ERS_POSN                         equ 0000h
PWM1ERS_ERS_POSITION                     equ 0000h
PWM1ERS_ERS_SIZE                         equ 0008h
PWM1ERS_ERS_LENGTH                       equ 0008h
PWM1ERS_ERS_MASK                         equ 00FFh
PWM1ERS_ERS0_POSN                        equ 0000h
PWM1ERS_ERS0_POSITION                    equ 0000h
PWM1ERS_ERS0_SIZE                        equ 0001h
PWM1ERS_ERS0_LENGTH                      equ 0001h
PWM1ERS_ERS0_MASK                        equ 0001h
PWM1ERS_ERS1_POSN                        equ 0001h
PWM1ERS_ERS1_POSITION                    equ 0001h
PWM1ERS_ERS1_SIZE                        equ 0001h
PWM1ERS_ERS1_LENGTH                      equ 0001h
PWM1ERS_ERS1_MASK                        equ 0002h
PWM1ERS_ERS2_POSN                        equ 0002h
PWM1ERS_ERS2_POSITION                    equ 0002h
PWM1ERS_ERS2_SIZE                        equ 0001h
PWM1ERS_ERS2_LENGTH                      equ 0001h
PWM1ERS_ERS2_MASK                        equ 0004h
PWM1ERS_ERS3_POSN                        equ 0003h
PWM1ERS_ERS3_POSITION                    equ 0003h
PWM1ERS_ERS3_SIZE                        equ 0001h
PWM1ERS_ERS3_LENGTH                      equ 0001h
PWM1ERS_ERS3_MASK                        equ 0008h

// Register: PWM1CLK
#define PWM1CLK PWM1CLK
PWM1CLK                                  equ 048Dh
// bitfield definitions
PWM1CLK_CLK_POSN                         equ 0000h
PWM1CLK_CLK_POSITION                     equ 0000h
PWM1CLK_CLK_SIZE                         equ 0008h
PWM1CLK_CLK_LENGTH                       equ 0008h
PWM1CLK_CLK_MASK                         equ 00FFh
PWM1CLK_CLK0_POSN                        equ 0000h
PWM1CLK_CLK0_POSITION                    equ 0000h
PWM1CLK_CLK0_SIZE                        equ 0001h
PWM1CLK_CLK0_LENGTH                      equ 0001h
PWM1CLK_CLK0_MASK                        equ 0001h
PWM1CLK_CLK1_POSN                        equ 0001h
PWM1CLK_CLK1_POSITION                    equ 0001h
PWM1CLK_CLK1_SIZE                        equ 0001h
PWM1CLK_CLK1_LENGTH                      equ 0001h
PWM1CLK_CLK1_MASK                        equ 0002h
PWM1CLK_CLK2_POSN                        equ 0002h
PWM1CLK_CLK2_POSITION                    equ 0002h
PWM1CLK_CLK2_SIZE                        equ 0001h
PWM1CLK_CLK2_LENGTH                      equ 0001h
PWM1CLK_CLK2_MASK                        equ 0004h
PWM1CLK_CLK3_POSN                        equ 0003h
PWM1CLK_CLK3_POSITION                    equ 0003h
PWM1CLK_CLK3_SIZE                        equ 0001h
PWM1CLK_CLK3_LENGTH                      equ 0001h
PWM1CLK_CLK3_MASK                        equ 0008h

// Register: PWM1LDS
#define PWM1LDS PWM1LDS
PWM1LDS                                  equ 048Eh
// bitfield definitions
PWM1LDS_LDS_POSN                         equ 0000h
PWM1LDS_LDS_POSITION                     equ 0000h
PWM1LDS_LDS_SIZE                         equ 0008h
PWM1LDS_LDS_LENGTH                       equ 0008h
PWM1LDS_LDS_MASK                         equ 00FFh
PWM1LDS_LDS0_POSN                        equ 0000h
PWM1LDS_LDS0_POSITION                    equ 0000h
PWM1LDS_LDS0_SIZE                        equ 0001h
PWM1LDS_LDS0_LENGTH                      equ 0001h
PWM1LDS_LDS0_MASK                        equ 0001h
PWM1LDS_LDS1_POSN                        equ 0001h
PWM1LDS_LDS1_POSITION                    equ 0001h
PWM1LDS_LDS1_SIZE                        equ 0001h
PWM1LDS_LDS1_LENGTH                      equ 0001h
PWM1LDS_LDS1_MASK                        equ 0002h
PWM1LDS_LDS2_POSN                        equ 0002h
PWM1LDS_LDS2_POSITION                    equ 0002h
PWM1LDS_LDS2_SIZE                        equ 0001h
PWM1LDS_LDS2_LENGTH                      equ 0001h
PWM1LDS_LDS2_MASK                        equ 0004h

// Register: PWM1PRL
#define PWM1PRL PWM1PRL
PWM1PRL                                  equ 048Fh
// bitfield definitions
PWM1PRL_PRL_POSN                         equ 0000h
PWM1PRL_PRL_POSITION                     equ 0000h
PWM1PRL_PRL_SIZE                         equ 0008h
PWM1PRL_PRL_LENGTH                       equ 0008h
PWM1PRL_PRL_MASK                         equ 00FFh

// Register: PWM1PRH
#define PWM1PRH PWM1PRH
PWM1PRH                                  equ 0490h
// bitfield definitions
PWM1PRH_PRH_POSN                         equ 0000h
PWM1PRH_PRH_POSITION                     equ 0000h
PWM1PRH_PRH_SIZE                         equ 0008h
PWM1PRH_PRH_LENGTH                       equ 0008h
PWM1PRH_PRH_MASK                         equ 00FFh

// Register: PWM1CPRE
#define PWM1CPRE PWM1CPRE
PWM1CPRE                                 equ 0491h
// bitfield definitions
PWM1CPRE_CPRE_POSN                       equ 0000h
PWM1CPRE_CPRE_POSITION                   equ 0000h
PWM1CPRE_CPRE_SIZE                       equ 0008h
PWM1CPRE_CPRE_LENGTH                     equ 0008h
PWM1CPRE_CPRE_MASK                       equ 00FFh

// Register: PWM1PIPOS
#define PWM1PIPOS PWM1PIPOS
PWM1PIPOS                                equ 0492h
// bitfield definitions
PWM1PIPOS_PIPOS_POSN                     equ 0000h
PWM1PIPOS_PIPOS_POSITION                 equ 0000h
PWM1PIPOS_PIPOS_SIZE                     equ 0008h
PWM1PIPOS_PIPOS_LENGTH                   equ 0008h
PWM1PIPOS_PIPOS_MASK                     equ 00FFh

// Register: PWM1GIR
#define PWM1GIR PWM1GIR
PWM1GIR                                  equ 0493h
// bitfield definitions
PWM1GIR_S1P1_POSN                        equ 0000h
PWM1GIR_S1P1_POSITION                    equ 0000h
PWM1GIR_S1P1_SIZE                        equ 0001h
PWM1GIR_S1P1_LENGTH                      equ 0001h
PWM1GIR_S1P1_MASK                        equ 0001h
PWM1GIR_S1P2_POSN                        equ 0001h
PWM1GIR_S1P2_POSITION                    equ 0001h
PWM1GIR_S1P2_SIZE                        equ 0001h
PWM1GIR_S1P2_LENGTH                      equ 0001h
PWM1GIR_S1P2_MASK                        equ 0002h
PWM1GIR_S1P1IF_POSN                      equ 0000h
PWM1GIR_S1P1IF_POSITION                  equ 0000h
PWM1GIR_S1P1IF_SIZE                      equ 0001h
PWM1GIR_S1P1IF_LENGTH                    equ 0001h
PWM1GIR_S1P1IF_MASK                      equ 0001h
PWM1GIR_S1P2IF_POSN                      equ 0001h
PWM1GIR_S1P2IF_POSITION                  equ 0001h
PWM1GIR_S1P2IF_SIZE                      equ 0001h
PWM1GIR_S1P2IF_LENGTH                    equ 0001h
PWM1GIR_S1P2IF_MASK                      equ 0002h

