garyPenhook/PIC-Assembler/device_includes/pic16f13254.inc
// Register: CM1NCH
#define CM1NCH CM1NCH
CM1NCH                                   equ 080Eh
// bitfield definitions
CM1NCH_NCH_POSN                          equ 0000h
CM1NCH_NCH_POSITION                      equ 0000h
CM1NCH_NCH_SIZE                          equ 0003h
CM1NCH_NCH_LENGTH                        equ 0003h
CM1NCH_NCH_MASK                          equ 0007h
CM1NCH_NCH0_POSN                         equ 0000h
CM1NCH_NCH0_POSITION                     equ 0000h
CM1NCH_NCH0_SIZE                         equ 0001h
CM1NCH_NCH0_LENGTH                       equ 0001h
CM1NCH_NCH0_MASK                         equ 0001h
CM1NCH_NCH1_POSN                         equ 0001h
CM1NCH_NCH1_POSITION                     equ 0001h
CM1NCH_NCH1_SIZE                         equ 0001h
CM1NCH_NCH1_LENGTH                       equ 0001h
CM1NCH_NCH1_MASK                         equ 0002h
CM1NCH_NCH2_POSN                         equ 0002h
CM1NCH_NCH2_POSITION                     equ 0002h
CM1NCH_NCH2_SIZE                         equ 0001h
CM1NCH_NCH2_LENGTH                       equ 0001h
CM1NCH_NCH2_MASK                         equ 0004h
CM1NCH_C1NCH0_POSN                       equ 0000h
CM1NCH_C1NCH0_POSITION                   equ 0000h
CM1NCH_C1NCH0_SIZE                       equ 0001h
CM1NCH_C1NCH0_LENGTH                     equ 0001h
CM1NCH_C1NCH0_MASK                       equ 0001h
CM1NCH_C1NCH1_POSN                       equ 0001h
CM1NCH_C1NCH1_POSITION                   equ 0001h
CM1NCH_C1NCH1_SIZE                       equ 0001h
CM1NCH_C1NCH1_LENGTH                     equ 0001h
CM1NCH_C1NCH1_MASK                       equ 0002h
CM1NCH_C1NCH2_POSN                       equ 0002h
CM1NCH_C1NCH2_POSITION                   equ 0002h
CM1NCH_C1NCH2_SIZE                       equ 0001h
CM1NCH_C1NCH2_LENGTH                     equ 0001h
CM1NCH_C1NCH2_MASK                       equ 0004h

// Register: CM1PCH
#define CM1PCH CM1PCH
CM1PCH                                   equ 080Fh
// bitfield definitions
CM1PCH_PCH_POSN                          equ 0000h
CM1PCH_PCH_POSITION                      equ 0000h
CM1PCH_PCH_SIZE                          equ 0003h
CM1PCH_PCH_LENGTH                        equ 0003h
CM1PCH_PCH_MASK                          equ 0007h
CM1PCH_PCH0_POSN                         equ 0000h
CM1PCH_PCH0_POSITION                     equ 0000h
CM1PCH_PCH0_SIZE                         equ 0001h
CM1PCH_PCH0_LENGTH                       equ 0001h
CM1PCH_PCH0_MASK                         equ 0001h
CM1PCH_PCH1_POSN                         equ 0001h
CM1PCH_PCH1_POSITION                     equ 0001h
CM1PCH_PCH1_SIZE                         equ 0001h
CM1PCH_PCH1_LENGTH                       equ 0001h
CM1PCH_PCH1_MASK                         equ 0002h
CM1PCH_PCH2_POSN                         equ 0002h
CM1PCH_PCH2_POSITION                     equ 0002h
CM1PCH_PCH2_SIZE                         equ 0001h
CM1PCH_PCH2_LENGTH                       equ 0001h
CM1PCH_PCH2_MASK                         equ 0004h
CM1PCH_C1PCH0_POSN                       equ 0000h
CM1PCH_C1PCH0_POSITION                   equ 0000h
CM1PCH_C1PCH0_SIZE                       equ 0001h
CM1PCH_C1PCH0_LENGTH                     equ 0001h
CM1PCH_C1PCH0_MASK                       equ 0001h
CM1PCH_C1PCH1_POSN                       equ 0001h
CM1PCH_C1PCH1_POSITION                   equ 0001h
CM1PCH_C1PCH1_SIZE                       equ 0001h
CM1PCH_C1PCH1_LENGTH                     equ 0001h
CM1PCH_C1PCH1_MASK                       equ 0002h
CM1PCH_C1PCH2_POSN                       equ 0002h
CM1PCH_C1PCH2_POSITION                   equ 0002h
CM1PCH_C1PCH2_SIZE                       equ 0001h
CM1PCH_C1PCH2_LENGTH                     equ 0001h
CM1PCH_C1PCH2_MASK                       equ 0004h

// Register: CM2CON0
#define CM2CON0 CM2CON0
CM2CON0                                  equ 0810h
// bitfield definitions
CM2CON0_SYNC_POSN                        equ 0000h
CM2CON0_SYNC_POSITION                    equ 0000h
CM2CON0_SYNC_SIZE                        equ 0001h
CM2CON0_SYNC_LENGTH                      equ 0001h
CM2CON0_SYNC_MASK                        equ 0001h
CM2CON0_HYS_POSN                         equ 0001h
CM2CON0_HYS_POSITION                     equ 0001h
CM2CON0_HYS_SIZE                         equ 0001h
CM2CON0_HYS_LENGTH                       equ 0001h
CM2CON0_HYS_MASK                         equ 0002h
CM2CON0_SP_POSN                          equ 0002h
CM2CON0_SP_POSITION                      equ 0002h
CM2CON0_SP_SIZE                          equ 0001h
CM2CON0_SP_LENGTH                        equ 0001h
CM2CON0_SP_MASK                          equ 0004h
CM2CON0_POL_POSN                         equ 0004h
CM2CON0_POL_POSITION                     equ 0004h
CM2CON0_POL_SIZE                         equ 0001h
CM2CON0_POL_LENGTH                       equ 0001h
CM2CON0_POL_MASK                         equ 0010h
CM2CON0_OUT_POSN                         equ 0006h
CM2CON0_OUT_POSITION                     equ 0006h
CM2CON0_OUT_SIZE                         equ 0001h
CM2CON0_OUT_LENGTH                       equ 0001h
CM2CON0_OUT_MASK                         equ 0040h
CM2CON0_EN_POSN                          equ 0007h
CM2CON0_EN_POSITION                      equ 0007h
CM2CON0_EN_SIZE                          equ 0001h
CM2CON0_EN_LENGTH                        equ 0001h
CM2CON0_EN_MASK                          equ 0080h
CM2CON0_C2SYNC_POSN                      equ 0000h
CM2CON0_C2SYNC_POSITION                  equ 0000h
CM2CON0_C2SYNC_SIZE                      equ 0001h
CM2CON0_C2SYNC_LENGTH                    equ 0001h
CM2CON0_C2SYNC_MASK                      equ 0001h
CM2CON0_C2HYS_POSN                       equ 0001h
CM2CON0_C2HYS_POSITION                   equ 0001h
CM2CON0_C2HYS_SIZE                       equ 0001h
CM2CON0_C2HYS_LENGTH                     equ 0001h
CM2CON0_C2HYS_MASK                       equ 0002h
CM2CON0_C2SP_POSN                        equ 0002h
CM2CON0_C2SP_POSITION                    equ 0002h
CM2CON0_C2SP_SIZE                        equ 0001h
CM2CON0_C2SP_LENGTH                      equ 0001h
CM2CON0_C2SP_MASK                        equ 0004h
CM2CON0_C2POL_POSN                       equ 0004h
CM2CON0_C2POL_POSITION                   equ 0004h
CM2CON0_C2POL_SIZE                       equ 0001h
CM2CON0_C2POL_LENGTH                     equ 0001h
CM2CON0_C2POL_MASK                       equ 0010h
CM2CON0_C2OUT_POSN                       equ 0006h
CM2CON0_C2OUT_POSITION                   equ 0006h
CM2CON0_C2OUT_SIZE                       equ 0001h
CM2CON0_C2OUT_LENGTH                     equ 0001h
CM2CON0_C2OUT_MASK                       equ 0040h
CM2CON0_C2EN_POSN                        equ 0007h
CM2CON0_C2EN_POSITION                    equ 0007h
CM2CON0_C2EN_SIZE                        equ 0001h
CM2CON0_C2EN_LENGTH                      equ 0001h
CM2CON0_C2EN_MASK                        equ 0080h

// Register: CM2CON1
#define CM2CON1 CM2CON1
CM2CON1                                  equ 0811h
// bitfield definitions
CM2CON1_INTN_POSN                        equ 0000h
CM2CON1_INTN_POSITION                    equ 0000h
CM2CON1_INTN_SIZE                        equ 0001h
CM2CON1_INTN_LENGTH                      equ 0001h
CM2CON1_INTN_MASK                        equ 0001h
CM2CON1_INTP_POSN                        equ 0001h
CM2CON1_INTP_POSITION                    equ 0001h
CM2CON1_INTP_SIZE                        equ 0001h
CM2CON1_INTP_LENGTH                      equ 0001h
CM2CON1_INTP_MASK                        equ 0002h
CM2CON1_C2INTN_POSN                      equ 0000h
CM2CON1_C2INTN_POSITION                  equ 0000h
CM2CON1_C2INTN_SIZE                      equ 0001h
CM2CON1_C2INTN_LENGTH                    equ 0001h
CM2CON1_C2INTN_MASK                      equ 0001h
CM2CON1_C2INTP_POSN                      equ 0001h
CM2CON1_C2INTP_POSITION                  equ 0001h
CM2CON1_C2INTP_SIZE                      equ 0001h
CM2CON1_C2INTP_LENGTH                    equ 0001h
CM2CON1_C2INTP_MASK                      equ 0002h

// Register: CM2NCH
#define CM2NCH CM2NCH
CM2NCH                                   equ 0812h
// bitfield definitions
CM2NCH_NCH_POSN                          equ 0000h
CM2NCH_NCH_POSITION                      equ 0000h
CM2NCH_NCH_SIZE                          equ 0003h
CM2NCH_NCH_LENGTH                        equ 0003h
CM2NCH_NCH_MASK                          equ 0007h
CM2NCH_NCH0_POSN                         equ 0000h
CM2NCH_NCH0_POSITION                     equ 0000h
CM2NCH_NCH0_SIZE                         equ 0001h
CM2NCH_NCH0_LENGTH                       equ 0001h
CM2NCH_NCH0_MASK                         equ 0001h
CM2NCH_NCH1_POSN                         equ 0001h
CM2NCH_NCH1_POSITION                     equ 0001h
CM2NCH_NCH1_SIZE                         equ 0001h
CM2NCH_NCH1_LENGTH                       equ 0001h
CM2NCH_NCH1_MASK                         equ 0002h
CM2NCH_NCH2_POSN                         equ 0002h
CM2NCH_NCH2_POSITION                     equ 0002h
CM2NCH_NCH2_SIZE                         equ 0001h
CM2NCH_NCH2_LENGTH                       equ 0001h
CM2NCH_NCH2_MASK                         equ 0004h
CM2NCH_C2NCH0_POSN                       equ 0000h
CM2NCH_C2NCH0_POSITION                   equ 0000h
CM2NCH_C2NCH0_SIZE                       equ 0001h
CM2NCH_C2NCH0_LENGTH                     equ 0001h
CM2NCH_C2NCH0_MASK                       equ 0001h
CM2NCH_C2NCH1_POSN                       equ 0001h
CM2NCH_C2NCH1_POSITION                   equ 0001h
CM2NCH_C2NCH1_SIZE                       equ 0001h
CM2NCH_C2NCH1_LENGTH                     equ 0001h
CM2NCH_C2NCH1_MASK                       equ 0002h
CM2NCH_C2NCH2_POSN                       equ 0002h
CM2NCH_C2NCH2_POSITION                   equ 0002h
CM2NCH_C2NCH2_SIZE                       equ 0001h
CM2NCH_C2NCH2_LENGTH                     equ 0001h
CM2NCH_C2NCH2_MASK                       equ 0004h

