garyPenhook/PIC-Assembler/device_includes/pic16f13254.inc
// Register: TRISC2PPS
#define TRISC2PPS TRISC2PPS
TRISC2PPS                                equ 01DD2h
// bitfield definitions
TRISC2PPS_TRISC2PPS_POSN                 equ 0000h
TRISC2PPS_TRISC2PPS_POSITION             equ 0000h
TRISC2PPS_TRISC2PPS_SIZE                 equ 0006h
TRISC2PPS_TRISC2PPS_LENGTH               equ 0006h
TRISC2PPS_TRISC2PPS_MASK                 equ 003Fh

// Register: TRISC3PPS
#define TRISC3PPS TRISC3PPS
TRISC3PPS                                equ 01DD3h
// bitfield definitions
TRISC3PPS_TRISC3PPS_POSN                 equ 0000h
TRISC3PPS_TRISC3PPS_POSITION             equ 0000h
TRISC3PPS_TRISC3PPS_SIZE                 equ 0006h
TRISC3PPS_TRISC3PPS_LENGTH               equ 0006h
TRISC3PPS_TRISC3PPS_MASK                 equ 003Fh

// Register: TRISC4PPS
#define TRISC4PPS TRISC4PPS
TRISC4PPS                                equ 01DD4h
// bitfield definitions
TRISC4PPS_TRISC4PPS_POSN                 equ 0000h
TRISC4PPS_TRISC4PPS_POSITION             equ 0000h
TRISC4PPS_TRISC4PPS_SIZE                 equ 0006h
TRISC4PPS_TRISC4PPS_LENGTH               equ 0006h
TRISC4PPS_TRISC4PPS_MASK                 equ 003Fh

// Register: TRISC5PPS
#define TRISC5PPS TRISC5PPS
TRISC5PPS                                equ 01DD5h
// bitfield definitions
TRISC5PPS_TRISC5PPS_POSN                 equ 0000h
TRISC5PPS_TRISC5PPS_POSITION             equ 0000h
TRISC5PPS_TRISC5PPS_SIZE                 equ 0006h
TRISC5PPS_TRISC5PPS_LENGTH               equ 0006h
TRISC5PPS_TRISC5PPS_MASK                 equ 003Fh

// Register: TRISC6PPS
#define TRISC6PPS TRISC6PPS
TRISC6PPS                                equ 01DD6h
// bitfield definitions
TRISC6PPS_TRISC6PPS_POSN                 equ 0000h
TRISC6PPS_TRISC6PPS_POSITION             equ 0000h
TRISC6PPS_TRISC6PPS_SIZE                 equ 0006h
TRISC6PPS_TRISC6PPS_LENGTH               equ 0006h
TRISC6PPS_TRISC6PPS_MASK                 equ 003Fh

// Register: TRISC7PPS
#define TRISC7PPS TRISC7PPS
TRISC7PPS                                equ 01DD7h
// bitfield definitions
TRISC7PPS_TRISC7PPS_POSN                 equ 0000h
TRISC7PPS_TRISC7PPS_POSITION             equ 0000h
TRISC7PPS_TRISC7PPS_SIZE                 equ 0006h
TRISC7PPS_TRISC7PPS_LENGTH               equ 0006h
TRISC7PPS_TRISC7PPS_MASK                 equ 003Fh

// Register: PPSLOCK
#define PPSLOCK PPSLOCK
PPSLOCK                                  equ 01E0Ch
// bitfield definitions
PPSLOCK_PPSLOCKED_POSN                   equ 0000h
PPSLOCK_PPSLOCKED_POSITION               equ 0000h
PPSLOCK_PPSLOCKED_SIZE                   equ 0001h
PPSLOCK_PPSLOCKED_LENGTH                 equ 0001h
PPSLOCK_PPSLOCKED_MASK                   equ 0001h

// Register: INTPPS
#define INTPPS INTPPS
INTPPS                                   equ 01E0Dh
// bitfield definitions
INTPPS_INTPPS_POSN                       equ 0000h
INTPPS_INTPPS_POSITION                   equ 0000h
INTPPS_INTPPS_SIZE                       equ 0007h
INTPPS_INTPPS_LENGTH                     equ 0007h
INTPPS_INTPPS_MASK                       equ 007Fh

// Register: T0CKIPPS
#define T0CKIPPS T0CKIPPS
T0CKIPPS                                 equ 01E0Eh
// bitfield definitions
T0CKIPPS_T0CKIPPS_POSN                   equ 0000h
T0CKIPPS_T0CKIPPS_POSITION               equ 0000h
T0CKIPPS_T0CKIPPS_SIZE                   equ 0007h
T0CKIPPS_T0CKIPPS_LENGTH                 equ 0007h
T0CKIPPS_T0CKIPPS_MASK                   equ 007Fh

// Register: T1CKIPPS
#define T1CKIPPS T1CKIPPS
T1CKIPPS                                 equ 01E0Fh
// bitfield definitions
T1CKIPPS_T1CKIPPS_POSN                   equ 0000h
T1CKIPPS_T1CKIPPS_POSITION               equ 0000h
T1CKIPPS_T1CKIPPS_SIZE                   equ 0007h
T1CKIPPS_T1CKIPPS_LENGTH                 equ 0007h
T1CKIPPS_T1CKIPPS_MASK                   equ 007Fh

// Register: T1GPPS
#define T1GPPS T1GPPS
T1GPPS                                   equ 01E10h
// bitfield definitions
T1GPPS_T1GPPS_POSN                       equ 0000h
T1GPPS_T1GPPS_POSITION                   equ 0000h
T1GPPS_T1GPPS_SIZE                       equ 0007h
T1GPPS_T1GPPS_LENGTH                     equ 0007h
T1GPPS_T1GPPS_MASK                       equ 007Fh

// Register: T3CKIPPS
#define T3CKIPPS T3CKIPPS
T3CKIPPS                                 equ 01E11h
// bitfield definitions
T3CKIPPS_T3CKIPPS_POSN                   equ 0000h
T3CKIPPS_T3CKIPPS_POSITION               equ 0000h
T3CKIPPS_T3CKIPPS_SIZE                   equ 0007h
T3CKIPPS_T3CKIPPS_LENGTH                 equ 0007h
T3CKIPPS_T3CKIPPS_MASK                   equ 007Fh

// Register: T3GPPS
#define T3GPPS T3GPPS
T3GPPS                                   equ 01E12h
// bitfield definitions
T3GPPS_T3GPPS_POSN                       equ 0000h
T3GPPS_T3GPPS_POSITION                   equ 0000h
T3GPPS_T3GPPS_SIZE                       equ 0007h
T3GPPS_T3GPPS_LENGTH                     equ 0007h
T3GPPS_T3GPPS_MASK                       equ 007Fh

// Register: T2INPPS
#define T2INPPS T2INPPS
T2INPPS                                  equ 01E19h
// bitfield definitions
T2INPPS_T2INPPS_POSN                     equ 0000h
T2INPPS_T2INPPS_POSITION                 equ 0000h
T2INPPS_T2INPPS_SIZE                     equ 0007h
T2INPPS_T2INPPS_LENGTH                   equ 0007h
T2INPPS_T2INPPS_MASK                     equ 007Fh

// Register: T4INPPS
#define T4INPPS T4INPPS
T4INPPS                                  equ 01E1Ah
// bitfield definitions
T4INPPS_T4INPPS_POSN                     equ 0000h
T4INPPS_T4INPPS_POSITION                 equ 0000h
T4INPPS_T4INPPS_SIZE                     equ 0007h
T4INPPS_T4INPPS_LENGTH                   equ 0007h
T4INPPS_T4INPPS_MASK                     equ 007Fh

// Register: CCP1PPS
#define CCP1PPS CCP1PPS
CCP1PPS                                  equ 01E1Eh
// bitfield definitions
CCP1PPS_CCP1PPS_POSN                     equ 0000h
CCP1PPS_CCP1PPS_POSITION                 equ 0000h
CCP1PPS_CCP1PPS_SIZE                     equ 0007h
CCP1PPS_CCP1PPS_LENGTH                   equ 0007h
CCP1PPS_CCP1PPS_MASK                     equ 007Fh

// Register: CCP2PPS
#define CCP2PPS CCP2PPS
CCP2PPS                                  equ 01E1Fh
// bitfield definitions
CCP2PPS_CCP2PPS_POSN                     equ 0000h
CCP2PPS_CCP2PPS_POSITION                 equ 0000h
CCP2PPS_CCP2PPS_SIZE                     equ 0007h
CCP2PPS_CCP2PPS_LENGTH                   equ 0007h
CCP2PPS_CCP2PPS_MASK                     equ 007Fh

